In [1]:
#!pip install pandas

### Intalación de librerias

In [2]:
import pandas as pd
import numpy as np

## Lista de eliminaciones de columnas de la BDD 'Diseño de registros de la base hogar'.
* AGLOMERADO: Eliminaremos esta columna, pero nos quedaremos solo con filas con registros de TDF(31).
* REALIZADA: No aporta nada a la base de datos
* ANO4: Como toda la BDD es del año 2018, podemos eliminarla.
* TRIMESTRE: Como toda la BDD es del mismo trimestre, podemos eliminarla.
* POND_TIC: No hay suficientes datos sobre esta columna.

In [3]:
# Carga de dataset.
df_hogares = pd.read_excel("C:/Users/marce/OneDrive/Documentos/TECNICATURA EN CS DE DATOS E IA/2DO AÑO/1ER CUATRIMESTRE/APRENDIZAJE AUTOMATICO/acceso_a_internet/data/raw/EPH_usu_hogar_tic_t418.xlsx")
df_hogares.head()

,CODUSU,NRO_HOGAR,REALIZADA,ANO4,TRIMESTRE,AGLOMERADO,POND_TIC,IH_II_01,IH_II_02
0,TQRMNOPPQHJMKMCDEFIAH00622969,1,1,2018,4,2,539,1,1
1,TQRMNOPPQHJMLUCDEFIAH00622993,1,1,2018,4,2,545,1,1
2,TQRMNOPPQHMMLUCDEFIAH00594749,1,1,2018,4,2,612,1,1
3,TQRMNOPPRHJMLUCDEFIAH00623008,1,1,2018,4,2,545,1,1
4,TQRMNOPPSHJMKMCDEFIAH00623022,1,1,2018,4,2,539,1,1

In [4]:
# Eliminar columnas innecesarias para el análisis.
df_hog = df_hogares.drop(columns=['REALIZADA', 'ANO4', 'TRIMESTRE', 'POND_TIC'])
df_hog.head()

                          CODUSU  NRO_HOGAR  AGLOMERADO  IH_II_01  IH_II_02
0  TQRMNOPPQHJMKMCDEFIAH00622969          1           2         1         1
1  TQRMNOPPQHJMLUCDEFIAH00622993          1           2         1         1
2  TQRMNOPPQHMMLUCDEFIAH00594749          1           2         1         1
3  TQRMNOPPRHJMLUCDEFIAH00623008          1           2         1         1
4  TQRMNOPPSHJMKMCDEFIAH00623022          1           2         1         1

In [5]:
# Recuento de filas antes de eliminar filas.
df_hog.count()

CODUSU        18600
NRO_HOGAR     18600
AGLOMERADO    18600
IH_II_01      18600
IH_II_02      18600
dtype: int64

In [6]:
# Eliminar filas innecesarias para el análisis (solo trabajaremos con datos de Rio Grande y Ushuaia)
df_hogtdf = df_hog[df_hog['AGLOMERADO'] == 31]
df_hogtdf.head()

,CODUSU,NRO_HOGAR,AGLOMERADO,IH_II_01,IH_II_02
12285,TQRMNOPPQHJMKPCDEIHJF00626473,1,31,1,1
12286,TQRMNOPPQHKMKNCDEIHJF00620952,1,31,1,1
12287,TQRMNOPPRHJMKPCDEIHJF00626438,1,31,1,1
12288,TQRMNOPPRHKNKQCDEIHJF00620859,1,31,1,1
12289,TQRMNOPPSHJMKMCDEIHJF00626453,1,31,1,1

In [7]:
# Recuento de filas después de eliminar filas.
df_hogtdf.count()

CODUSU        398
NRO_HOGAR     398
AGLOMERADO    398
IH_II_01      398
IH_II_02      398
dtype: int64

In [8]:
# Una vez filtrado la columna con los datos de Rio Grande y Ushuaia, procedemos a eliminarla.
df_hogtdf = df_hogtdf.drop(columns=['AGLOMERADO'])
df_hogtdf.head()

                              CODUSU  NRO_HOGAR  IH_II_01  IH_II_02
12285  TQRMNOPPQHJMKPCDEIHJF00626473          1         1         1
12286  TQRMNOPPQHKMKNCDEIHJF00620952          1         1         1
12287  TQRMNOPPRHJMKPCDEIHJF00626438          1         1         1
12288  TQRMNOPPRHKNKQCDEIHJF00620859          1         1         1
12289  TQRMNOPPSHJMKMCDEIHJF00626453          1         1         1

## Lista de eliminaciones de columnas de la BDD 'Diseño de registros de la base personas'.
* AGLOMERADO: Eliminaremos esta columna, pero nos quedaremos solo con filas con registros de TDF(31).
* ANO4: Como toda la BDD es del año 2018, podemos eliminarla.
* TRIMESTRE: Como toda la BDD es del mismo trimestre, podemos eliminarla.
* POND_TIC: No hay suficientes datos sobre esta columna.
* RESPONDENTE: No hay datos sobre esta columna.

In [9]:
# Carga de dataset
df_personas = pd.read_excel("C:/Users/marce/OneDrive/Documentos/TECNICATURA EN CS DE DATOS E IA/2DO AÑO/1ER CUATRIMESTRE/APRENDIZAJE AUTOMATICO/acceso_a_internet/data/raw/EPH_usu_Indiv_tic_t418.xlsx")
df_personas.head()

,CODUSU,NRO_HOGAR,COMPONENTE,ANO4,TRIMESTRE,AGLOMERADO,POND_TIC,RESPONDENTE,IP_III_04,IP_III_05,IP_III_06
0,TQRMNOPPQHJMKMCDEFIAH00622969,1,1,2018,4,2,539,1.0,1,1,1
1,TQRMNOPPQHJMKMCDEFIAH00622969,1,2,2018,4,2,539,1.0,1,1,1
2,TQRMNOPPQHJMKMCDEFIAH00622969,1,3,2018,4,2,539,1.0,1,1,1
3,TQRMNOPPQHJMLUCDEFIAH00622993,1,1,2018,4,2,545,2.0,1,1,1
4,TQRMNOPPQHJMLUCDEFIAH00622993,1,2,2018,4,2,545,2.0,1,1,1

In [10]:
# Eliminar columnas innecesarias para el análisis.
df_per = df_personas.drop(columns=['ANO4', 'TRIMESTRE', 'POND_TIC', 'RESPONDENTE'])
df_per.head()

,CODUSU,NRO_HOGAR,COMPONENTE,AGLOMERADO,IP_III_04,IP_III_05,IP_III_06
0,TQRMNOPPQHJMKMCDEFIAH00622969,1,1,2,1,1,1
1,TQRMNOPPQHJMKMCDEFIAH00622969,1,2,2,1,1,1
2,TQRMNOPPQHJMKMCDEFIAH00622969,1,3,2,1,1,1
3,TQRMNOPPQHJMLUCDEFIAH00622993,1,1,2,1,1,1
4,TQRMNOPPQHJMLUCDEFIAH00622993,1,2,2,1,1,1

In [11]:
# Recuento de filas antes de eliminar filas.
df_per.count()

CODUSU        54178
NRO_HOGAR     54178
COMPONENTE    54178
AGLOMERADO    54178
IP_III_04     54178
IP_III_05     54178
IP_III_06     54178
dtype: int64

In [12]:
# Eliminar filas innecesarias para el análisis (solo trabajaremos con datos de Rio Grande y Ushuaia)
df_pertdf = df_per[df_per['AGLOMERADO'] == 31]
df_pertdf.head()

,CODUSU,NRO_HOGAR,COMPONENTE,AGLOMERADO,IP_III_04,IP_III_05,IP_III_06
36805,TQRMNOPPQHJMKPCDEIHJF00626473,1,1,31,1,1,1
36806,TQRMNOPPQHJMKPCDEIHJF00626473,1,2,31,1,1,1
36807,TQRMNOPPQHKMKNCDEIHJF00620952,1,1,31,1,1,1
36808,TQRMNOPPQHKMKNCDEIHJF00620952,1,2,31,1,1,1
36809,TQRMNOPPQHKMKNCDEIHJF00620952,1,3,31,1,1,2

In [13]:
# Recuento de filas después de eliminar filas.
df_pertdf.count()

CODUSU        1144
NRO_HOGAR     1144
COMPONENTE    1144
AGLOMERADO    1144
IP_III_04     1144
IP_III_05     1144
IP_III_06     1144
dtype: int64

In [14]:
# Una vez filtrado la columna con los datos de Rio Grande y Ushuaia, procedemos a eliminarla.
df_pertdf = df_pertdf.drop(columns=['AGLOMERADO'])
df_pertdf.head()

,CODUSU,NRO_HOGAR,COMPONENTE,IP_III_04,IP_III_05,IP_III_06
36805,TQRMNOPPQHJMKPCDEIHJF00626473,1,1,1,1,1
36806,TQRMNOPPQHJMKPCDEIHJF00626473,1,2,1,1,1
36807,TQRMNOPPQHKMKNCDEIHJF00620952,1,1,1,1,1
36808,TQRMNOPPQHKMKNCDEIHJF00620952,1,2,1,1,1
36809,TQRMNOPPQHKMKNCDEIHJF00620952,1,3,1,1,2

In [15]:
# Se agrega la columna 'ID_PERSONAS' entre las columnas 'CODOSU' y 'NRO_HOGAR'
df_pertdf.insert(1, 'ID_PERSONAS', np.arange(1, len(df_pertdf)+1))
df_pertdf.head()

,CODUSU,ID_PERSONAS,NRO_HOGAR,COMPONENTE,IP_III_04,IP_III_05,IP_III_06
36805,TQRMNOPPQHJMKPCDEIHJF00626473,1,1,1,1,1,1
36806,TQRMNOPPQHJMKPCDEIHJF00626473,2,1,2,1,1,1
36807,TQRMNOPPQHKMKNCDEIHJF00620952,3,1,1,1,1,1
36808,TQRMNOPPQHKMKNCDEIHJF00620952,4,1,2,1,1,1
36809,TQRMNOPPQHKMKNCDEIHJF00620952,5,1,3,1,1,2

In [16]:
# Se agrega la columnas 'IH_II_01' y 'IH_II_02' que hace referencia a que si el hogar cuenta con computadora/s y
# disponen de acceso a internet.
df_pertdf['IH_II_01'] = None
df_pertdf['IH_II_02'] = None
df_pertdf.head()

,CODUSU,ID_PERSONAS,NRO_HOGAR,COMPONENTE,IP_III_04,IP_III_05,IP_III_06,IH_II_01,IH_II_02
36805,TQRMNOPPQHJMKPCDEIHJF00626473,1,1,1,1,1,1,None,None
36806,TQRMNOPPQHJMKPCDEIHJF00626473,2,1,2,1,1,1,None,None
36807,TQRMNOPPQHKMKNCDEIHJF00620952,3,1,1,1,1,1,None,None
36808,TQRMNOPPQHKMKNCDEIHJF00620952,4,1,2,1,1,1,None,None
36809,TQRMNOPPQHKMKNCDEIHJF00620952,5,1,3,1,1,2,None,None

In [17]:
# Concatenar los valores de 'IH_II_01' del dataset de hogares a 'IH_II_01' del dataset de personas.

# Iterar sobre el dataset df_pertdf.
for index1, row1 in df_pertdf.iterrows():
    idhouse1 = row1['CODUSU']
    
    # Buscar el numero de 'CODUSU' correspondiente en el dataset de hogares.
    for index2, row2 in df_hogtdf.iterrows():
        idhouse2 = row2['CODUSU']
        ii_01 = row2['IH_II_01']
        
        # Si encontramos el mismo 'CODUSU' en ambos datasets, copiamos 'IH_II_01' de hogares a 'IH_II_01' del 
        # dataset de personas.
        if idhouse1 == idhouse2:
            df_pertdf.loc[index1, 'IH_II_01'] = ii_01
            break

In [18]:
# Concatenar los valores de 'IH_II_02' del dataset de hogares a 'IH_II_02' del dataset de personas.

# Iterar sobre el dataset df_pertdf.
for index1, row1 in df_pertdf.iterrows():
    idhouse1 = row1['CODUSU']
    
    # Buscar el numero de 'CODUSU' correspondiente en el dataset de hogares.
    for index2, row2 in df_hogtdf.iterrows():
        idhouse2 = row2['CODUSU']
        ii_02 = row2['IH_II_02']
        
        # Si encontramos el mismo 'CODUSU' en ambos datasets, copiamos 'IH_II_02' de hogares a 'IH_II_02' del 
        # dataset de personas.
        if idhouse1 == idhouse2:
            df_pertdf.loc[index1, 'IH_II_02'] = ii_02
            break

In [19]:
# Se muestra el dataset de personas con las columnas adicionadas 'IH_II_01' e 'IH_II_02' con sus valores.
df_pertdf.head()

,CODUSU,ID_PERSONAS,NRO_HOGAR,COMPONENTE,IP_III_04,IP_III_05,IP_III_06,IH_II_01,IH_II_02
36805,TQRMNOPPQHJMKPCDEIHJF00626473,1,1,1,1,1,1,1,1
36806,TQRMNOPPQHJMKPCDEIHJF00626473,2,1,2,1,1,1,1,1
36807,TQRMNOPPQHKMKNCDEIHJF00620952,3,1,1,1,1,1,1,1
36808,TQRMNOPPQHKMKNCDEIHJF00620952,4,1,2,1,1,1,1,1
36809,TQRMNOPPQHKMKNCDEIHJF00620952,5,1,3,1,1,2,1,1

In [20]:
# Se guarga una copia del dataset de personas ya procesada en la carpeta processed.
df_pertdf.to_excel("../data/processed/EPH_usu_hogar_tic_t418_V1.xlsx")